read_verilog mux_unstriping.v 
hierarchy -check -top mux_unstriping

proc; opt; fsm; opt; memory; opt

techmap; opt

dfflibmap -liberty cmos_cells.lib

abc -liberty cmos_cells.lib

clean

write_verilog mux_unstriping_E.v 