# read design
read_verilog phy_tx.v Demux32_8.v module_Flops.v module_Recirculacion.v module_PS.v demux_striping.v
hierarchy -check -top phy_tx

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

# mapping flip-flops to cmos_cells.lib
dfflibmap -liberty cmos_cells.lib

# mapping logic to cmos_cells.lib
abc -liberty cmos_cells.lib

# cleanup
clean

# write synthesized design
write_verilog phy_tx_synth.v