read_verilog demux_striping.v 
hierarchy -check -top demux_striping

proc; opt; fsm; opt; memory; opt

techmap; opt

dfflibmap -liberty cmos_cells.lib

abc -liberty cmos_cells.lib

clean

write_verilog demux_striping_E.v 