read_verilog module_Recirculacion.v
hierarchy -check -top module_Recirculacion

proc; opt; fsm; opt; memory; opt

techmap; opt

dfflibmap -liberty cmos_cells.lib

abc -liberty cmos_cells.lib

clean

write_verilog module_Recirculacion_Sint.v 
