read_verilog module_Flops.v
hierarchy -check -top module_Flops

proc; opt; fsm; opt; memory; opt

techmap; opt

dfflibmap -liberty cmos_cells.lib

abc -liberty cmos_cells.lib

clean

write_verilog module_Flops_Sint.v 
