# read design
read_verilog Mux8_32.v
hierarchy -check -top Mux8_32

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

# mapping flip-flops to cmos_cells.lib
dfflibmap -liberty cmos_cells.lib

# mapping logic to cmos_cells.lib
abc -liberty cmos_cells.lib

# cleanup
clean

# write synthesized design
write_verilog Mux8_32_synth.v