# read design
read_verilog Demux32_8.v
hierarchy -check -top Demux32_8

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

# mapping flip-flops to cmos_cells.lib
dfflibmap -liberty cmos_cells.lib

# mapping logic to cmos_cells.lib
abc -liberty cmos_cells.lib

# cleanup
clean

# write synthesized design
write_verilog Demux32_8_synth.v